index=* sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" 
    EventCode=1 
    net.exe OR net1.exe
``` 1min time span ``` | bucket _time span=1m
| eval time=strftime(min_time,"%m/%d/%y %H:%M:%S")
| stats count by ComputerName, _time, host, Image, CommandLine
| sort _time
