index=cisnet-ws `sysmon` EventCode=11 TargetFilename IN ("*\.txt", "*\.html", "*\.hta")
| bin _time span=10s
| dedup ComputerName, _time, TargetFilename
| replace "NOT_TRANSLATED" with "" IN User
| stats min(_time) as firstTime max(_time) as lastTime dc(TargetFilename) as unique_readme_path_count values(TargetFilename) as list_of_readme_path by ComputerName Image TargetFilename User
| where unique_readme_path_count >= 1
| eval firstTime=strftime(firstTime,"%Y/%m/%d %T")
| eval lastTime=strftime(lastTime, "%Y/%m/%d %T")
| table firstTime, lastTime, ComputerName, User, host, Image, TargetFilename, unique_readme_path_count
| sort -firstTime
